In [14]:
import cx_Oracle
dsn = cx_Oracle.makedsn('localhost', 1521, 'orclhj')
db = cx_Oracle.connect('system', '1234', dsn)

sql = '''
    select * from emp
'''

In [15]:
import pandas as pd
data = pd.read_sql(sql, con=db)

In [16]:
data.head()

   EMPNO   ENAME       JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN    20.0
1   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN    30.0
2   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0    30.0
3   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0    30.0
4   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0    30.0